load-tests/myTest.yml
config:
  target: http://127.0.0.1:4000
  phases:
    - duration: 3
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 3
      arrivalRate: 5
      rampTo: 5
      name: Ramp up load
    - duration: 3
      arrivalRate: 7
      rampTo: 10
      name: Spike phase 
      
  config:

  engines:
    playwright: {}
  # Path to JavaScript file that defines Playwright test functions
  processor: './shopping.cjs'
scenarios:
  - engine: playwright
    testFunction: 'myTestFlow'